codebase/projects/web/test/src/resources/edu/duke/cabig/c3pr/webservice/integration/testdata/UpdateSubjectRequest.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:sub="http://enterpriseservices.nci.nih.gov/SubjectManagementService"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
        xmlns:ent="http://enterpriseservices.nci.nih.gov"
	xmlns:iso="uri:iso.org:21090"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xsi:schemaLocation="uri:iso.org:21090 ISO_datatypes_Narrative.xsd http://enterpriseservices.nci.nih.gov SubjectManagement.xsd">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap:mustUnderstand="1"><Assertion xmlns="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" AssertionID="_84a2dba9583195eb43fab0d3abf3f356" IssueInstant="2010-08-09T19:36:59.319Z" Issuer="dkrylov" MajorVersion="1" MinorVersion="1"><AuthenticationStatement AuthenticationInstant="2010-08-09T19:36:59.319Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password"><Subject><NameIdentifier NameQualifier="c3pr">jdoe01</NameIdentifier><SubjectConfirmation><ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</ConfirmationMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509Data>
<ds:X509Certificate>
MIIDBjCCAsMCBExgWAQwCwYHKoZIzjgEAwUAMGgxDDAKBgNVBAYTA1VTQTELMAkGA1UECBMCVkEx
EDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFudGljMQ8wDQYDVQQLEwZDb2RpbmcxFTAT
BgNVBAMTDERlbmlzIEtyeWxvdjAeFw0xMDA4MDkxOTMzMjRaFw0xMDExMDcxOTMzMjRaMGgxDDAK
BgNVBAYTA1VTQTELMAkGA1UECBMCVkExEDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFu
dGljMQ8wDQYDVQQLEwZDb2RpbmcxFTATBgNVBAMTDERlbmlzIEtyeWxvdjCCAbgwggEsBgcqhkjO
OAQBMIIBHwKBgQD9f1OBHXUSKVLfSpwu7OTn9hG3UjzvRADDHj+AtlEmaUVdQCJR+1k9jVj6v8X1
ujD2y5tVbNeBO4AdNG/yZmC3a5lQpaSfn+gEexAiwk+7qdf+t8Yb+DtX58aophUPBPuD9tPFHsMC
NVQTWhaRMvZ1864rYdcq7/IiAxmd0UgBxwIVAJdgUI8VIwvMspK5gqLrhAvwWBz1AoGBAPfhoIXW
mz3ey7yrXDa4V7l5lK+7+jrqgvlXTAs9B4JnUVlXjrrUWU/mcQcQgYC0SRZxI+hMKBYTt88JMozI
puE8FnqLVHyNKOCjrh4rs6Z1kW6jfwv6ITVi8ftiegEkO8yk8b6oUZCJqIPf4VrlnwaSi2ZegHtV
JWQBTDv+z0kqA4GFAAKBgQDHeWl2X3DU7++f2MUfUKKSd6IAfkMd8/3r4tg5n12BhnqmnIiBX0rE
p47Nsn6bFK4kEEhXggb62Tm+XamuoTocvXRFwFKzJxVDi3O7Qgy1a8gutLSkPtwnoVos2gnoJULX
isk/G8q0fkLHnfrcmPKRh4MHvKQwSGxlMXGJzgW9tDALBgcqhkjOOAQDBQADMAAwLQIUF83BLhDU
gjRXybQuhiDEp9baBjMCFQCBuvPoXWRi3wgYshBzxI0ebaLMiQ==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo></SubjectConfirmation></Subject></AuthenticationStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#dsa-sha1" />
<ds:Reference URI="#_84a2dba9583195eb43fab0d3abf3f356">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="code ds kind rw saml samlp typens #default xsd xsi" /></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
<ds:DigestValue>nyKQmWEfKc+aQnOVfcMeJQOFfI8=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>W5MR1Ia4NUFS1nibEgruQPrDQYRpQlAv7sU+R/a0kR79157nGb1L9Q==</ds:SignatureValue>
<ds:KeyInfo>
<ds:X509Data>
<ds:X509Certificate>
MIIDBjCCAsMCBExgWAQwCwYHKoZIzjgEAwUAMGgxDDAKBgNVBAYTA1VTQTELMAkGA1UECBMCVkEx
EDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFudGljMQ8wDQYDVQQLEwZDb2RpbmcxFTAT
BgNVBAMTDERlbmlzIEtyeWxvdjAeFw0xMDA4MDkxOTMzMjRaFw0xMDExMDcxOTMzMjRaMGgxDDAK
BgNVBAYTA1VTQTELMAkGA1UECBMCVkExEDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFu
dGljMQ8wDQYDVQQLEwZDb2RpbmcxFTATBgNVBAMTDERlbmlzIEtyeWxvdjCCAbgwggEsBgcqhkjO
OAQBMIIBHwKBgQD9f1OBHXUSKVLfSpwu7OTn9hG3UjzvRADDHj+AtlEmaUVdQCJR+1k9jVj6v8X1
ujD2y5tVbNeBO4AdNG/yZmC3a5lQpaSfn+gEexAiwk+7qdf+t8Yb+DtX58aophUPBPuD9tPFHsMC
NVQTWhaRMvZ1864rYdcq7/IiAxmd0UgBxwIVAJdgUI8VIwvMspK5gqLrhAvwWBz1AoGBAPfhoIXW
mz3ey7yrXDa4V7l5lK+7+jrqgvlXTAs9B4JnUVlXjrrUWU/mcQcQgYC0SRZxI+hMKBYTt88JMozI
puE8FnqLVHyNKOCjrh4rs6Z1kW6jfwv6ITVi8ftiegEkO8yk8b6oUZCJqIPf4VrlnwaSi2ZegHtV
JWQBTDv+z0kqA4GFAAKBgQDHeWl2X3DU7++f2MUfUKKSd6IAfkMd8/3r4tg5n12BhnqmnIiBX0rE
p47Nsn6bFK4kEEhXggb62Tm+XamuoTocvXRFwFKzJxVDi3O7Qgy1a8gutLSkPtwnoVos2gnoJULX
isk/G8q0fkLHnfrcmPKRh4MHvKQwSGxlMXGJzgW9tDALBgcqhkjOOAQDBQADMAAwLQIUF83BLhDU
gjRXybQuhiDEp9baBjMCFQCBuvPoXWRi3wgYshBzxI0ebaLMiQ==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo></ds:Signature></Assertion></wsse:Security>
	</soapenv:Header>

	<soapenv:Body>
		<sub:UpdateSubjectRequest>
			<subject>
				<ent:entity xsi:type="ent:Person" xmlns:ent="http://enterpriseservices.nci.nih.gov">
					<ent:administrativeGenderCode code="Female" />
					<ent:birthDate value="19810101000000" />
					<ent:deathDate value="19910101000000"></ent:deathDate>

					<ent:biologicEntityIdentifier>
						<ent:effectiveDateRange nullFlavor="NI" />
						<ent:identifier extension="${identifier}" identifierName="MRN" />
						<ent:typeCode code="MRN" />
						<ent:assigningOrganization>
							<ent:organizationIdentifier>
								<ent:identifier extension="MN026" />
								<ent:primaryIndicator value="true" />
								<ent:typeCode code="CTEP" />
							</ent:organizationIdentifier>
						</ent:assigningOrganization>
					</ent:biologicEntityIdentifier>

					<ent:deathIndicator value="true" />
					<ent:ethnicGroupCode>
						<iso:item code="Unknown" />
					</ent:ethnicGroupCode>
					<ent:maritalStatusCode code="Married" />
					<ent:name>
						<iso:item>
							<iso:part type="GIV" value="Johny" />
							<iso:part type="GIV" value="X" />
							<iso:part type="FAM" value="Doezer" />
						</iso:item>
					</ent:name>
					<ent:postalAddress>
						<iso:item>
							<iso:part value="3029 N Stuart St Unit 999" type="SAL" />
							<iso:part value="AArlington" type="CTY" />
							<iso:part value="GA" type="STA" />
							<iso:part value="52203-9292" type="ZIP" />
							<iso:part value="USA" type="CNT" />
						</iso:item>
						<iso:item>
							<iso:part value="3029 N Stuart St Unit 999" type="SAL" />
							<iso:part value="Mclean" type="CTY" />
							<iso:part value="DC" type="STA" />
							<iso:part value="52203-9292" type="ZIP" />
							<iso:part value="USA" type="CNT" />
						</iso:item>
					</ent:postalAddress>
					<ent:raceCode>
						<iso:item code="Unknown" />						
					</ent:raceCode>
					<ent:telecomAddress>
						<iso:item value="mailto:johndoe2@semanticbits.com" />
						<iso:item value="tel:666-555-5555" />
						<iso:item value="x-text-fax:666-555-5555" />
					</ent:telecomAddress>
				</ent:entity>
			</subject>
		</sub:UpdateSubjectRequest>
	</soapenv:Body>
</soapenv:Envelope>